#Вычислить число c заданной точностью d
n = float(input('Введите необходимую точность (0.1 или 0.01 и т.д): '))

k = 1
x = 0
for k in range(1, 10000000):
    x = x+4*((-1)**(k+1))/(2*k-1)

n = n **(-1)

x = int(x*n)/n

print(x)

